In [19]:
import pandas as pd

In [20]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'David'],
    'Age': [25, 30, 28, 25, 30, 27],
    'City': ['New York', 'Los Angeles', 'Chicago', 'New York', 'Los Angeles', 'Houston']
}

In [21]:
df=pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   28      Chicago
3    Alice   25     New York
4      Bob   30  Los Angeles
5    David   27      Houston

In [22]:
df['duplicated']=df.duplicated()

In [23]:
df.shape

(6, 4)

In [24]:
df

      Name  Age         City  duplicated
0    Alice   25     New York       False
1      Bob   30  Los Angeles       False
2  Charlie   28      Chicago       False
3    Alice   25     New York        True
4      Bob   30  Los Angeles        True
5    David   27      Houston       False

In [25]:
df = df.drop(columns=['duplicated'])

In [26]:
df.drop_duplicates(inplace=True)

In [27]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   28      Chicago
5    David   27      Houston

In [28]:
df.shape

(4, 3)